{"text":"US 5459828 A\nA method of producing a raster font from a contour font entailing the steps of deriving font metrics and character metrics of font characters in terms of arbitrary font units; scaling the font characters to a selected size and output resolution (pixels per unit length); altering the thickness of vertical and horizontal strokes of each character to a desired thickness, from the measured font metrics and character metrics, and including a difference applied to the thickness of the strokes by the printer process, to cause the strokes to be close to an integer number of pixels and thickness and to compensate for thinning and thickening which the printing engine might produce; bringing the leading and trailing edges of the characters to integer pixel locations, where such locations are based on and scaling the character between the leading and trailing edges proportionally therebetween, and producing a rasterized font from the altered contour font character.\n1. A printer processor implemented method for producing a raster font from a contour font defined by a list of points connected by curves, said raster font suitable for printing on a selected printer having known reproduction characteristics, including the steps of:\na) deriving for a contour font a set of font metrics and character metrics of a character in the font defined in terms of arbitrary font units;\nb) scaling a character contour defined in arbitrary font units to a selected size in units of pixels;\nc) altering thickness of character strokes by adjusting vertical and horizontal coordinates of each point defining the character contour in directions defined by a vector normal to the character contour at each point, by an amount required to obtain a desired thickness from the measured font metrics and character metrics, and an amount required to add to difference thickness thereto in accordance with the selected printer reproduction characteristics, said alteration amounts together causing the vertical and horizontal strokes to be sufficiently close to an integer number of pixels or half pixels so as to cause subsequent numerical rounding to produce uniform results across the font;\nd) grid aligning the contour of each character so that leading and trailing edges, and top and bottom edges of the contour of each character fall on whole or half pixel positions; and\ne) applying a rasterization function to the contour to convert each contour font character to a bitmap.\n2. The method as defined in claim 1 wherein in said grid alignment step, after aligning said leading and top edges of said contours of each character on a whole pixel position, the length of any lines joining leading and trailing edges, and lines joining top and bottom edges, are rounded to an integer number of whole or half pixels, and the trailing edge and bottom edges are aligned at whole pixel positions.\n3. In a printing system for printing on a selected printer having reproduction characteristics known and available as contour font correction data, wherein a font to be printed has a set of predefined font metrics and character metrics for each character in the font defined in terms of arbitrary font units, the method of preparing a contour font defined by a list of points connected by curves, for printing on the selected printer including the ordered steps of:\na) scaling each character in the contour font to a selected print resolution in pixels per unit length;\nb) altering thickness of character strokes by adjusting vertical and horizontal coordinates of each point defining the contour of each character to a desired thickness in directions defined by a vector, normal to the character contour at each point, by an amount required to obtain a desired thickness from the measured font metrics and character metrics, and an amount required to add a difference thickness thereto in accordance with the contour font correction data for a particular printer, to cause the vertical and horizontal stroke thickness to approximate an integer number of pixels so as to cause subsequent numerical rounding to produce uniform results across the font;\nc) grid aligning the contour of each character so that leading and trailing edges, and top and bottom edges of the contour of each character fall on whole pixel positions; and\nd) applying a rasterization function to the contour convert each contour font character to a bitmap.\n4. The method as defined in claim 3 wherein in said grid alignment step, after aligning said leading and top edges of said contours of each character on a whole pixel position, the length of any lines joining leading and trailing edges, and lines joining top and bottom edges, are rounded to an integer number of pixels or half pixels, and the trailing edge and bottom edges are aligned at whole pixel positions.\nA microfiche Appendix, having 5 fiche and 398 frames, is included herewith.\nThe present invention relates generally to the production of raster fonts from contour fonts, and more particularly, to a method of producing raster fonts from contour fonts taking into account characteristics of the contour font and the printer system which will ultimately print the font.\nA portion of the disclosure of this patent document contains material which is subject to copyright protection. The copyright owner has no objection to the facsimile reproduction by anyone of the patent document or the patent disclosure, as it appears in the Patent and Trademark Office files or records, but otherwise reserves all rights whatsoever.\nCross reference is made to U.S. patent application Ser. No. 07\/416,211 by S. Marshall, entitled \"Rapid Halfbitting Stepper\", and assigned to the same assignee as the present invention.\nU.S. Pat. No. 4,675,830 to Hawkins is incorporated herein by reference for the purposes of background information on contour fonts. U.S. patent application Ser. No. 07\/416,211 by S. Marshall, entitled \"Rapid Halfbitting Stepper\", and assigned to the same assignee as the present invention, is incorporated by reference herein for the purposes of teaching rasterization.\n\"Contour fonts\" is a term that refers to the use of outlines or contours to describe the shapes of characters used in electronic printing. In a contour font, each character shape is represented by one or more closed curves or paths that traces the boundary of the character. The contour is specified by a series of mathematical equations, which may be in any of several forms, the most common being circular arcs, straight lines, and polynomial expressions. The shape of the contour font is that of the ideal design of the character and, generally, does not depend on parameters associated with any printer. Contour fonts are ideal for use as master representations of typefaces.\nBitmap fonts or raster fonts are composed of the actual characters images that will be printed on a page, and are made by scaling contours to the appropriate size, quantizing or sampling them at the resolution of the printer, and filling the interiors of the characters with black bits or pixels. Achieving high quality in this process is difficult, except at very high resolutions, and requires knowledge of both the marking technology and typographic design considerations. Often, a bitmap font is delivered to a printer. There is a separate bitmap font for each size of a font, and sometimes separate fonts for landscape and portrait orientations.\nThe advantage of a contour font is that it can be scaled to any size and rotated to any angle by simple mathematics. Therefore, a single font suffices to represent all possible printing sizes and orientation, reducing font storage requirements, reducing the cost of font handling.\nThe difficulty in this approach is in achieving high quality character images during the sampling process which generates the raster characters from the contour masters. If the contour character is simply sampled, there will be random .+-.1 pixel variations in stroke thickness. If the printing process tends to erode black areas (common in write-white laser xerography) characters will be consistently too thin. If the printing process tends to fatten black areas (common in write black laser xerography), characters will be too thick.\nAt the high resolution employed in phototypesetters, usually greater than 1,000 spi, no special techniques are required for scaling and sampling the contour font to generate a raster font of any size. This is because although simple sampling necessarily has random one-bit errors, such errors are small compared to the size of the character, making errors insignificant. At 300, 400, and 600 spi though, character strokes are only three or four bits thick and each bit is important. The simplistic methods used by typesetter manufacturers are not sufficient.\nU.S. Pat. No. 4,675,830 to Hawkins, uses defined points in a contour font that must be grid aligned to pixel positions, but the stem widths or edges are not aligned.\nOf particular importance in generating fonts of optimal appearance are maintenance of uniform and correct stroke thickness among characters of a font and on different printing engines, uniform alignment of characters on a baseline, and uniform spacing of characters.\nIn accordance with the invention, there is provided a method for conversion of contour fonts to bitmap fonts with automatic thickening and thinning of strokes, and snapping of character edges to pixel or half pixel boundaries.\nIn accordance with the invention, there is provided a method of producing a raster font from a contour font entailing the steps of: first, deriving font metrics and character metrics of font characters in terms of arbitrary font units; scaling the font characters to a selected size and output resolution (pixels per unit length); altering the thickness of vertical and horizontal strokes of each character to a desired thickness, from the measured font metrics and character metrics, and including a difference applied to the thickness of the strokes by the printer process, to cause the strokes to be close to an integer number of pixels and thickness and to compensate for thing and thickening which the printing engine might produce; bringing the leading and trailing edges of the characters to integer pixel locations, where such locations are based on and scaling the character between the leading and trailing edges proportionally therebetween, and producing a rasterized font from the altered contour font character.\nThese and other aspects of the invention will become apparent from the following description used to illustrate a preferred embodiment of the invention in conjunction with the accompanying drawings in which:\nFIG. 1 shows a block diagram of the inventive optimized scaler rasterizer system.\nFIGS. 2A-2E illustrate the development of a raster font from a contour font, using the system described in FIG. 1.\nWith reference to the drawing, where the showing is for the purpose of illustrating an embodiment of the invention and not for the purpose of limiting same, the Figure shows a block diagram of the present invention which will be referred to and described hereinafter.\nFIG. 1 shows a block diagram of the contour rasterization process of the present invention. Beginning with a contour font 10, and with a character \"H\" shown in contour for illustration purposes at FIG. 2A the contour font is analyzed initially at hint generation step 20. At the hint generation, the parameters defining the font are determined, including measurement of the following metrics and character hints:\nTABLE 1______________________________________Font Metric Comments______________________________________Cap-height Height of the H, I or similar letterX-Height Height of the lower case xAscender Height of the lower case k, b, or similar letterDescender Position of the bottom of the lower case p or qThickness of Upper Vertical stroke thicknessCase Stems on upper case H or KThickness of Upper Horizontal Stroke onCase Cross-Strokes upper case E or FThickness of Lower Vertical stroke thicknessCase Stems on lower case k or lThickness of Lower Case Horizontal strokeCross-Strokes thickness on the fThickness of AuxiliaryCharacter StemsThickness of AuxiliaryCharacter Cross-StrokesHairline thickness Thickness of the cross bar on the e or the thin part of the o______________________________________\n(See, Appendix, page 13, ICFFontIODefs. Mesa)\nCharacter hints are generated for each character and include the following:\nTABLE 2______________________________________Character Metric Comments______________________________________Position of all horizontal Left sides of strokes areedges and indications of leading edges and rightwhether each edge is a sides or strokes areleading or trailing edge. trailing edges.Position of all verticaledges and indication ofwhether each edge is aleading or trailing edge.Direction of the normalvector (perpendicular)to the contour at eachcontrol point in thecontour, pointingtoward the whiteregion.______________________________________\nAt hint generation 20, the font metrics and chara, after thickening by the font thickening steps, and the minimum stroke thickness specified in the printer profile. When applied, this thickening brings fine lines up to the value of the minimum stroke thickness. The value is zero if the hairline is already greater than the minimum stroke thickness. (This process, referred to as \"adaptive thickening,\" is not disclosed in the source code in the Appendix.)\nThe actual thickening or thinning applied is equal to the sum of these three components. Each component has an independent value in the X and Y directions. The direction to move each contour control point is specified by its normal vector. The thickened character H is shown at FIG. C.\nAt step 60, the snap function or grid alignment function is applied. The coordinate system of the character is varied in the horizontal direction to move vertical and horizontal edges to positions where pixel boundaries will be after rasterization, i.e., to a whole pixel position. This is to assure uniform stroke thickness in the rasterized character images. The process is to piecewise stretch or shrink the character to force edges to align the pixel boundaries. On the left hand sides of the characters, the left edge of each stroke is moved to the closest pixel boundary, while the right edge of the stroke is moved to the pixel boundary specified by rounding the stroke thickness. This process gives priority to maintaining uniform stroke thickness over absolute stroke position. That is to say, that after the left edge of the character has been moved to a whole pixel position, the thickness of the stroke, or portion of the character, is examined to determine its thickness. The thickness has already been adjusted in the thickness of thinning step, so that it is close to a whole pixel width. Accordingly, the right edge of the character is then moved to the nearest whole pixel, based on rounding the thickness of the pixel, as opposed to moving the right hand side to the nearest pixel. On the right hand sides of characters, the rolls of left and right edges of strokes are reversed. Right edges of strokes are anchored, while left edges are rounded relatively to corresponding right edges. (see, Appendix, page 355, snap.c).\nIn one variant of this scheme, the positions of left and right index points or width points, which are those points which determine character spacing and are made to coincide in constructing words, are snapped before the vertical edges.\nIn the vertical direction, snapping is performed to piecewise stretch characters so that positions of baseline, cap-height, x-height, and descender fall on pixel boundaries. Baseline and descender position are treated as bottoms of strokes, that is, anchored, while cap-height and x-height are treated as tops of strokes, computed relative to the baseline. All characters are snapped to all of these positions, ensuring uniform character alignment. After these font metric positions are snapped, horizontal edges are snapped in the same manner as vertical edges, with lower edges of strokes anchored and upper edges snapped relative to the lower edges in the lower half of the character and upper edges of strokes anchored and lower edges snapped relative to the upper edges in the upper half of the character.\nIn both horizontal and vertical directions, snapping is performed one edge at a time. That is, the first edge is snapped, stretching the coordinate system of the character slightly on one side of the snapped edge and shrinking it slightly on the other side. The second edge is then snapped, with its pre-snapping position perhaps already modified slightly by the first snap. This sequential snapping helps preserve local character features better than simultaneous snapping of all edges does. When the second edge is snapped, its area of influence on the coordinate grid extends only up to the first snapped edge, which stays in place. This process is then repeated for the remainder of the edges. The snapped character H is shown at FIG. 2D.\nOnce each character in the adjusted contour font has been placed in the grid and appropriately thickened and thinned, the final step is to sample the adjusted contour on discrete grid. This step 70 can optionally produce half bitted output images, as controlled by the printer profile. Light half bitting produces half bitting on curves and diagonals, while heavy half bitting will also produce half bitted vertical and horizontal edges.\nRasterization in a preferred embodiment of this invention is in accordance with the process described in U.S. patent application Ser. No. 07\/416,211 by S. Marshall, entitled \"Rapid Halfbitting Stepper\", and assigned to the present assignee of the present invention. This application is incorporated by reference herein for the purposes of teaching rasterization. (see, Appendix, page 364, step.c and page 368, step.h for rasterization with halfbitting; page 372, bezline.c for stepping around curve; page 396, fill.c for filling). The rasterized character is shown at FIG. 2D.\nIt will not doubt be appreciated that numerous changes and modifications are likely to occur to those skilled in the art, and it is intended in the appended claims to cover all those changes and modifications which fall within the spirit and scope of the present invention.","id":"<urn:uuid:5cf8f2cc-bc5c-42e1-a62b-bddf45ac1cba>","dump":"CC-MAIN-2013-20","url":"http:\/\/www.google.de\/patents\/US5459828","file_path":"s3:\/\/commoncrawl\/crawl-data\/CC-MAIN-2013-20\/segments\/1368696381249\/warc\/CC-MAIN-20130516092621-00000-ip-10-60-113-184.ec2.internal.warc.gz","language":"en","language_score":0.8994696736,"token_count":5093,"score":2.59375,"int_score":3}
{"text":"An Introduction To 127.0.0.1\n127.0.0.1 is an IP address utilized for a looplock network connection. What does this mean? If\na user tries to connect to this IP address, they will be sent back to their computer. The address\nis also known as a localhost. The localhost is the computer.\nHow the Localhost Works\nIf the command is relayed to the localhost, you would be hooked up to the system where the\ncommands were sent out. For instance, suppose the computer is called \"Joker\". If you telnet\nfrom the Joker computer to the localhost, a message will appear. It will attempt to hook up to\nThe localhost is employed in lieu of the computer hostname to be linked to. This IP address is\nthe most wisely used localhost address. However, you can actually use any IP address\nprovided it starts with 127. This means 127.*.*.* can be used as a localhost.\nEstablishing a connection with the loopback address is similar to creating a connection with\nremote network computers. The only difference is you don't have to deal with network\nFor this reason it is widely utilized by software developers. It is also used by system\nadministrators. It is often used for testing programs and apps. If the connection is IPv4, the\ncomputer's loopback address will be the 127.*.*.*. The subnet mask is typically 255.0.0.0.\nThis IP addresses 127.*.*.*. are defined in RFC 330 as Special-Use IPv4 Addresses. The\n127.0.0.0\/8 block is defined as the Net host loopback address. If a higher level protocol sends\na datagram anywhere in the block, it will be looped in the host. This is typically implemented\nwith the 127.0.0.1 \/ 32 for looplock. However, addresses in the block must not be visible\nanywhere else in the network.\nThere is also a localhost IPv6 version. In RFC 3513, it is defined as Internet Protocol Version\n6 (IPv6) Addressing Architecture::1\/128.\nMore Information about the Localhost\nIn simple terms, the localhost means the computer. It is the hostname allocated loopback\nnetwork interface address. The name is likewise a domain name. This will help prevent\nconfusion with the hostname definition. In IPv6, the loopback IP address is ::1. The localhost\nis stated when one would usually use the computer hostname. For instance, a browser using\nan HTTP server to http:\/\/localhost will show the local website home page. This will be\npossible if the server is set up properly to work the loopback interface.\nThe loopback address can also be used for linking up to a game server. It can also be used for\nthe various inter-process communications. This facts about 127.0.0.1 indicate how\nfundamental and basic the localhost is to a system. That's why it is so crucial for network","id":"<urn:uuid:0cfb12fb-ebfd-4e6a-8720-c551d7e97801>","dump":"CC-MAIN-2013-20","url":"http:\/\/pdfcast.org\/pdf\/a-guide-to-localhost","file_path":"s3:\/\/commoncrawl\/crawl-data\/CC-MAIN-2013-20\/segments\/1368696381249\/warc\/CC-MAIN-20130516092621-00000-ip-10-60-113-184.ec2.internal.warc.gz","language":"en","language_score":0.8938439488,"token_count":644,"score":3.8125,"int_score":4}
{"text":"PROTECTION OF SUBTROPICAL AND TROPICAL AGRICULTURE COMMODITIES AND ORNAMENTALS FROM EXOTIC INSECTS\nLocation: Subtropical Horticulture Research\nTitle: Laurel wilt: A global threat to avocado production\n| Ploetz, R - |\n| Smith, J - |\n| Inch, S - |\n| Pena, J - |\n| Evans, E - |\n| Crane, J - |\n| Hulcr, J - |\n| Stelinski, L - |\n| Schnell, R - |\nSubmitted to: World Avocado Congress\nPublication Type: Proceedings\nPublication Acceptance Date: November 28, 2011\nPublication Date: February 1, 2012\nCitation: Ploetz, R.C., Smith, J.A., Inch, S.A., Pena, J.E., Evans, E.A., Crane, J.H., Kendra, P.E., Hulcr, J., Stelinski, L., Schnell, R. 2012. Laurel wilt: A global threat to avocado production. World Avocado Congress. 186-197 In Proceedings VII World Avocado Congress. 5-9 September 2011, Cairns, Australia.\nInterpretive Summary: Laurel wilt is a lethal vascular disease of trees in the plant family Lauraceae, including avocado. It is caused by a fungal pathogen (Raffaelea lauricola) that is introduced into host trees by an exotic wood-boring beetle, the redbay ambrosia beetle (Xyleborus glabratus). The beetle was first detected in Georgia in 2002, and since has spread to six states in the southeastern U.S. Laurel wilt poses an imminent threat to commercial avocado production in south Florida, and a future threat to avocado in California, Mexico, Central and South America. Scientists at the USDA-ARS Subtropical Horticulture Research Station, in collaboration with the University of Florida, are conducting multidisciplinary research on the pest complex, including (1) evaluation of fungicides for laurel wilt, (2) screening for disease resistant avocado varieties, (3) determination of pathways for disease transmission, (4) identification of beetle attractants, repellents, and insecticides, and (5) assessment of host preferences. Information from these studies will be used by avocado growers and by state and federal action agencies engaged in monitoring programs for redbay ambrosia beetle.\nLaurel wilt kills members of the Lauraceae plant family, including avocado. The disease has invaded much of the southeastern USA, and threatens avocado commerce and homeowner production in Florida, valuable germplasm in Miami (USDA-ARS), and major production and germplasm in California and MesoAmerica. Laurel wilt is caused by a recently described fungus, Raffaelea lauricola, which is vectored by an invasive ambrosia beetle, Xyleborus glabratus. Current research topics include: disease management with fungicides; identifying host resistance; vector mitigation with insecticides and repellents; host ranges of, and interactions with, the pathogen and vector; and transmission of R. lauricola via avocado seed, scion material, root grafts and pruning tools. Although highly resistant avocado cultivars have not been identified, screening work continues on additional cultivars and new germplasm. Effective fungicides (e.g. triazoles) have been identified, but cost-effective disease management will depend on improved measures for xylem loading and retention of these chemicals. Insecticides have been identified that reduce boring activity of X. glabratus and its attraction to avocado and other hosts, but much remains to be learned about their impact on disease management. Although the disease’s host range is generally restricted to American members of the Lauraceae, nonhosts that attract the beetle are known. Raffaelela lauricola rapidly colonizes avocado after infection, but to low levels; tylose and gel induction in the host, rather than xylem obstruction by fungal biomass, are associated with impeded water transport and symptom development. Seed and fruit from laurel wilt-affected avocado trees do not appear to be infected by R. lauricola.","id":"<urn:uuid:f5bb6156-473c-456e-b20e-b29dce901e8a>","dump":"CC-MAIN-2013-20","url":"http:\/\/www.ars.usda.gov\/research\/publications\/publications.htm?seq_no_115=280283","file_path":"s3:\/\/commoncrawl\/crawl-data\/CC-MAIN-2013-20\/segments\/1368696381249\/warc\/CC-MAIN-20130516092621-00000-ip-10-60-113-184.ec2.internal.warc.gz","language":"en","language_score":0.8892325163,"token_count":905,"score":3.0,"int_score":3}
{"text":"St. Anne, Patroness of Detroit\nSt. Anne was named by the Vatican as the patron saint of the Archdiocese of Detroit. We honor the mother of the Blessed Virgin Mary and prayerfully ask for her intercession.\nOne may pray to any saint for any intention, but a patron saint is seen as the particular advocate for a chosen place or activity.\nSt. Anne is the mother of the Blessed Virgin Mary. Though she is not mentioned by name in the Bible, we know of her through early Christian writings, the most important of which is the Protoevangelium of James, written in about 150 A.D.\nWe are told that Anne, the wife of Joachim, was advanced in years before her prayers for a child were answered. An angel appeared and told her she would conceive a child who \"shall be spoken of in all the world.\"\nSt. Anne's feast day is celebrated on July 26. She is known as the patron saint of equestrians, housewives, women in labor, cabinet-makers, and miners.\nDevotion to St. Anne became popular in the Christian East by the fourth century, and that tradition later spread to the Christian West. When the French began to colonize modern-day Quebec, they brought their devotion to St. Anne with them—asking for her protection in the New World.\nThis devotion was planted on the banks of the Detroit River by the original French-Canadian settlers. Two days after Antoine de la Mothe Cadillac landed with 51 others in what is now downtown Detroit on July 24, 1701, they celebrated Mass and began construction of a church named after Saint Anne.\nToday, Ste. Anne de Detroit Church is the second oldest continually operating parish in the United States. As is now recognized by the Holy See, the church of Detroit was placed under St. Anne's protection from its very founding.","id":"<urn:uuid:8e1cef78-a3fc-4eeb-b94f-f8ec251e2e20>","dump":"CC-MAIN-2013-20","url":"http:\/\/www.aod.org\/our-archdiocese\/history-of-the-archdiocese\/patron-saint\/","file_path":"s3:\/\/commoncrawl\/crawl-data\/CC-MAIN-2013-20\/segments\/1368696381249\/warc\/CC-MAIN-20130516092621-00000-ip-10-60-113-184.ec2.internal.warc.gz","language":"en","language_score":0.9797120094,"token_count":386,"score":2.796875,"int_score":3}
{"text":"Science Fair Project Encyclopedia\nIndustrial Design is an applied art whereby the aesthetics and usability of products may be improved. Design aspects specified by the industrial designer may include the overall shape of the object, the location of details with respect to one another, colors, texture, sounds, and aspects concerning the use of the product ergonomics. Additionally the industrial designer may specify aspects concerning the production process, choice of materials and the way the product is presented to the consumer at the point of sale. The use of industrial designers in a product development process may lead to added values by improved usability, lowered production costs and more appealing products.\nProduct Design is focused on products only, while industrial design has a broader focus on concepts, products and processes. In addition to considering aesthetics, usability, and ergonomics, it can also encompass the engineering of objects, usefulness as well as usability, market placement, and other concerns.\nProduct Design and Industrial Design can overlap into the fields of user interface design , information design and interaction design. Various schools of Industrial Design and\/or Product Design may specialize in one of these aspects, ranging from pure art colleges (product styling) to mixed programs of engineering and design, to related disciplines like exhibit design and interior design.\nIn the US, the field of industrial design hit a high-water mark of popularity in the late 30's and early 40's, with several industrial designers becoming minor celebrities. Raymond Loewy, Norman bel Geddes, and Henry Dreyfuss remain the best known.\nIn the UK, the term \"Industrial Design\" increasingly implies design with considerable engineering and technology awareness alongside human factors - a \"Total Design\" approach, promoted by the late Stuart Pugh (University of Strathclyde) and others.\nFamous industrial designers\n- Egmont Arens (1888-1966)\n- Norman bel Geddes (1893-1958)\n- Henry Dreyfuss (1904-1972)\n- Charles and Ray Eames (1907-1978) and (1912-1988)\n- Harley J. Earl (1893-1969)\n- Virgil Exner (1909-1973)\n- Buckminster Fuller (1895-1983)\n- Kenneth Grange (1929- )\n- Michael Graves (1934- )\n- Walter Adolph Gropius (1883-1969)\n- Jonathan Ive (1967- )\n- Arne Jacobsen (1902-1971)\n- Raymond Loewy (1893-1986)\n- Ludwig Mies van der Rohe (1886-1969)\n- László Moholy-Nagy (1895-1946)\n- Victor Papanek (1927-1999)\n- Philippe Starck (1949- )\n- Brooks Stevens (1911-1995)\n- Walter Dorwin Teague (1883-1960)\n- Eva Zeisel (1906- )\n- Industrial design rights\n- Design classics\n- Interaction Design\n- Automobile design\n- Six Sigma\n- Famous Industrial Designers\n- Design Council on Product Design Design Council one stop shop information resource on Product Design by Dick Powell.\n- Industrial Designers Society of America\n- The Centre for Sustainable Design\n- International Council of Societies of Industrial Designers\n- U.S. Occupational Outlook Handbook: Designers\n- Core77: Industrial Designers' Online Community\nThe contents of this article is licensed from www.wikipedia.org under the GNU Free Documentation License. Click here to see the transparent copy and copyright details","id":"<urn:uuid:a466a758-3d7d-477a-8ae7-30c1404a9da8>","dump":"CC-MAIN-2013-20","url":"http:\/\/www.all-science-fair-projects.com\/science_fair_projects_encyclopedia\/Industrial_design","file_path":"s3:\/\/commoncrawl\/crawl-data\/CC-MAIN-2013-20\/segments\/1368696381249\/warc\/CC-MAIN-20130516092621-00000-ip-10-60-113-184.ec2.internal.warc.gz","language":"en","language_score":0.8557734489,"token_count":743,"score":3.203125,"int_score":3}
{"text":"A California-based company is attempting to introduce\nexpert crowdsourcing to oncology to try and ensure that each\ncancer patient gets the most appropriate treatment.\nCommons brings together leading physicians and scientists in\neach type of cancer to create an open-source wiki-style database\nthat will catalogue the different genomic subtypes of each disease\nand show how patients are responding to different treatments.\nThe project is based on the hypothesis that every\npatient's tumour is, to some extent, unique. Although most\ncancer drugs are tested individually in large-scale clinical\ntrials, the majority of physicians (70 percent) prescribe cocktails\nof drugs based on their individual experience and particular\ngenomic subtype of the cancer. By capturing, aggregating and\nanalysing the genomic and results data of these individual drug\nexperiments -- cross referencing them with the large scale clinical\ntrials and studies -- physicians might be able to more efficiently\nfind the most appropriate treatment for their patients.\nCancer Commons was set up by Jay \"Marty\"\nTenenbaum -- a Silicon Valley entrepreneur and\ncancer survivor who founded a range of e-commerce companies\nincluding CommerceNet and Veo Systems. He also\nfounded Enterprise Integration Technologies, the first company\nto conduct a commercial internet transaction, in 1992. More\nrecently he has focused on transforming healthcare, launching CollabRx, which uses computers\nto personalise cancer treatments and accelerate research (and which\npowers Cancer Commons).\nTenenbaum argues that there are thousands of studies that are\npublished each year, with only a handful of them getting national\nor international attention. Furthermore, there are hundreds of\nthousands of individual \"trials\" being conducted by doctors (some\n30,000 oncologists in the US, where the program is limited to for\nthe time being) who are experimenting with different cocktails of\ndrugs on their patients. Without one central place to store\nand access these studies, scientific and clinical advancement in\nthis field is being artificially held back.\nA major hurdle for the project is getting researchers to supply\ntheir data to the site, rather than hold out for a career-making\narticle in a peer-reviewed journal. Tenenbaum is frustrated by how\nlittle data is shared between peers and hopes that Cancer Commons\ncould mark the dawn of a new era of open-source science.\nTenenbaum told Wired.co.uk: \"There is lots of talking in\nfragmented silos, but we want to capture all of that in one place\nand expedite the process through which science turns into\nThe first stage of Cancer Commons is to create a database where\neach different type of cancer has a \"Molecular Disease Model\" (MDM)\n-- an expert-curated reference node that catalogues the known\nmolecular subtypes of a particular cancer, linked to relevant\npathways, diagnostic tests, approved and experimental therapies and\ncurrent clinical trials. Each is akin to a dynamic research paper\nthat reflects the latest scientific, clinical and technological\nadvancements. A rapid submission and dissemination process allows\neach MDM to be maintained online and continuously updated by cancer\nspecialists and moderated by editors.\nThe project is governed by an editorial board with an impressive\nset of credentials. The 18 specialists -- chaired by George\nLundberg, former editor-in-chief of Journal of the American Medical\nAssociation and of WebMD's online properties\nand e-Medicine --\ninclude a former FDA Commissioner, a former editor of\nScience and a former president of the American Society of\nSo far, only one model has been created, for melanoma. It\nincorporates 78,185 abstracts from research papers and information\nrelating to some 1016 clinical trials that are ongoing in the\nfield. Some 11 expert editors have been assigned to that particular\nMDM, including Dr David Fisher, the head of the dermatology at\nHarvard Medical School and Dr Keith Flaherty, from the department\nof medicine at Harvard Medical School. Over the coming year the\nplan is to create MDMs for other cancers including lung, breast,\nsarcoma, and lymphoma -- each with their own experts overseeing\nIn order to harness the power of the MDM, CollabRx is developing\napps that tap into the data to aid decision-making. For example,\nthe \"Targeted Therapy Finder\" can be used by doctors to help\nidentify genetic tests that map an individual tumour's unique\ncharacteristics, and then select potential treatments based on the\nfindings. By entering information about the particular tumour,\nthey'll be given options of tests that'll help narrow down the\nparticular subtype of cancer being dealt with (as categorised by\nthe MDM), and therefore find out which treatments are the most\npromising. They can then find information about trials that are\nlooking for patients with that particular subtype.\nThe view is to develop further apps that allow doctors and\nresearchers to submit clinical observations and outcomes and then\ncollaboratively analyse them to fine-tune the MDMs. Tenenbaum would\nalso like to see patients report how they're responding to\ntreatments. He tells Wired.co.uk: \"Over time I'd like the\nresults of lab tests to go directly into the database.\"\nHe doesn't underestimate the enormity of the task, admitting\nthat not all of the details are worked out yet and that the initial\nMDMs will \"almost certainly be incomplete and wrong in places\". He\nadds: \"We don't pretend that we are going to cure cancer. But we\nought to be able to improve the outcomes for some patients.\"\nTenenbaum wants to make applications that are so compelling to\ndoctors that they'll have to use them to stay relevant in their\nfields. \"I see possibilities to slash time and development of new\ndrugs and improve patient care.\"","id":"<urn:uuid:261b3732-bc1b-48c7-9ed5-c7eb4c1cba6d>","dump":"CC-MAIN-2013-20","url":"http:\/\/www.wired.co.uk\/news\/archive\/2011-02\/01\/cancer-commons","file_path":"s3:\/\/commoncrawl\/crawl-data\/CC-MAIN-2013-20\/segments\/1368696381249\/warc\/CC-MAIN-20130516092621-00000-ip-10-60-113-184.ec2.internal.warc.gz","language":"en","language_score":0.9305593967,"token_count":1246,"score":2.703125,"int_score":3}
{"text":"Staff Photo: Jason Braverman Girl Scouts Kennedy Watson, from left, Leah Royes and Kaitlyn Hamlette, of troop 4525 in Snellville, draw signs to promote cookie sales.\nLemon-wedge cookies dusted with powdered sugar and filled with lemon zest flavor\nThe shortbread cookie\nOatmeal cookies with peanut butter filling\nVanilla cookies covered in caramel and toasted coconut, then striped with chocolate\nCookie topped with peanut butter then completely covered in chocolate\nThin wafer covered in a peppermint chocolate\n1912 — On March 12, 1912, founder Juliette Gordon Low gathered 18 girls to register the first troop of American Girl Guides. It was renamed Girl Scouts the following year.\n1920s — The first Girl Scout Troops on Foreign Soil were established in China, Mexico, Saudi Arabia and Syria for American girls living in other countries.\n1930s — The first sale of commercially baked Girl Scout Cookies took place.\n1940s — Girls collected 1.5 million articles of clothing that were then shipped overseas to children and adult victims of war.\n1950s — The March 1952 issue of “Ebony” magazine reported, “Girl Scouts in the South are making steady progress toward breaking down racial taboos.”\n1960s — The social unrest of the 1960s was reflected in organization actions and Girl Scout program change, including introduction in 1963 of four program age–levels for girls: Brownie, Junior, Cadette and Senior Girl Scouts.\n1970s — Girl Scouts contributed to a White House Conference on food, nutrition and health.\n1980s — “The Contemporary Issues” series was developed in the 1980s to help girls and their families deal with serious social issues. The first, “Tune In to Well Being, Say No to Drugs,” was introduced in collaboration with a project initiated by First Lady Nancy Reagan.\n1990s — Girl Scouting experienced a renewed emphasis on physical fitness with the inauguration of a health and fitness national service project in 1994 and the GirlSports initiative in 1996.\n2000s — Grants from Fortune 500 companies such as Lucent Technologies, Intel and Lockheed Martin supported science and technology exploration programs for girls.\n2012 — Girl Scouts of the USA has declared 2012 the Year of the Girl: a celebration of girls, recognition of their leadership potential and a commitment to creating a coalition of like-minded organizations and individuals in support of balanced leadership in the workplace and in communities across the country.\nSNELLVILLE -- It's that time of year. Across Gwinnett -- and the nation -- young girls dressed in green, brown, tan and blue vests are selling the famous Girl Scouts cookies by the boxes and they have a new cookie this year, the Savannah Smiles.\nHaven't heard of it? It's the latest creation to celebrate the organization's 100th anniversary.\nThe girls from Troop No. 4525 in Snellville, just like millions of other girls, are bound and determined to sell their cookies to anyone who will buy a box for $3.50.\n\"This is exciting to me because I started out as a Girl Scout with my sister in Brooklyn, N.Y.,\" Troop Co-leader Qualena Odom-Royes said. \"Now being able to share it with Leah (my daughter) and these other girls is exciting and wonderful.\"\nThe troop worked on posters to advertise their confectionery sweets and set individual sales goals for 2012.\nWith much childhood exuberance, Jocelyn Spencer, 8, decided on 81,000 boxes.\n\"I'm going to get everyone in my family to sell cookies,\" she said.\nAnd she's not the only one aiming big. The other girls in the troop set goals in the hundreds.\n\"I'm going to try to raise 400 because I really want all of the prizes,\" Kennedy Watson, 8, said.\nGirl Scout Cookies In Recipes\nTry using Girl Scout Cookies as part of fun recipes\nIn addition to the usual cookies, Girl Scouts of the USA has introduced its latest creation, the Savannah Smiles, to commemorate its 100th year. These celebratory baked goods were created in honor of Girl Scouts founder Juliette Gordon Low's hometown of Savannah and are similar in taste to past customer favorites with bursts of lemon flavor.\nThe cookie is shaped like a wedge, covered in powered sugar and filled with lemon crisps.\n\"The Savannah Smiles is actually closer to the original cookies made for the Girl Scout sales. It was one of the first varieties out there,\" Troop Co-leader Adrienne Cole said.\nThe cookie is such a new addition to the Girl Scouts, the troops and their leaders haven't gotten to taste-test the lemon flavored treat.\n\"I really want to try the new cookie,\" Kaitlyn Hamlette, 6, said. \"I like lemony stuff, so I really want to try it.\"\nAda Hamlette of Loganville, Kaitlyn's mother added, \"Everyone is excited about the new cookie and they want to try them. They look like they'll be delicious.\"\nTo boost the Savannah Smiles' sales, Troop No. 4525 thought of a strategic marketing approach: Give out free samples while selling boxes around the county.\n\"I want to give a box of milk to everyone who eats a sample,\" Spencer said.\nCole chimed in, \"Maybe we can get Kroger to donate some milk.\"\nYour hips may be mad that you bought the cookies, but your heart won't feel the same. All of the proceeds from Girl Scouts of Greater Atlanta's fundraising activities, including the cookie drive, stay in the council to serve the girls and volunteers in many ways. The money delivers programs to 41,500 girl members in a 34-county territory, trains more than 18,000 adult member volunteers, provides approximately $52,000 in scholarships for higher education and so much more.\nThe Girls Scouts of the USA haven't started selling their cookies online yet, but could in the next few years. The organization recommends never buying Girl Scout Cookies on any sites, including Amazon, eBay and other auction or community sites. There is no guarantee of freshness or authenticity.\nTo keep up with a technological age, the organization is using its website to help buyers easily find troops to purchase from in the area. Starting Feb. 17, the public can use the Cookie Locator, a program set up to help locate girls selling in your neighborhood by entering your ZIP code. To use the locator, visit cookielocator.littlebrownie.com.\nTo learn more about the Girl Scout's 100th anniversary and the Savannah Smiles, visit www.girlscouts.org.","id":"<urn:uuid:75027875-cebe-4b88-8101-bd4f0ab2f4b9>","dump":"CC-MAIN-2013-20","url":"http:\/\/www.gwinnettdailypost.com\/news\/2012\/jan\/21\/cookie-time-girl-scouts-celebrating-100th\/?sports","file_path":"s3:\/\/commoncrawl\/crawl-data\/CC-MAIN-2013-20\/segments\/1368696381249\/warc\/CC-MAIN-20130516092621-00000-ip-10-60-113-184.ec2.internal.warc.gz","language":"en","language_score":0.9521913528,"token_count":1389,"score":2.765625,"int_score":3}
{"text":"Bali Climate conference has a message for rural community\nThe world leaders recognised that 20% of the global emission of greenhouse gases (GHGs) can be contained by forestation. The programme, Reducing Emissions From Deforestation and Degradation (REDD) aims to compensate the developing countries in the tropical region to maintain their forests and discourages deforestation. It allows developing countries to sell carbon offsets to rich countries in return for not burning their tropical forests from 2013.\nREDD initiative is the need of the hour when largescale deforestation is taking place across the world for urbanisation, oil palm, soyabean and bio-fuel crop plantation.\nThe Bali conference also stressed upon the urgent need to cut carbon and methane emissions from tropical forests.\nThe Bali conference also adopted a resolution on adaptation fund to help poor nations to cope with damage from climate change impact like droughts, extreme weather conditions or rising seas. The Adaptation Fund now comprises only about $36 million but might rise to $1-$5 billion a year by 2030, if investments in green technology in developing nations surges. The fund distinguished the responsibilities of the Global Environment Facility and the World Bank. The fund would have a 16-member board largely from developing countries and would start operating from 2008.\nSenior researchers of the United Nations Development Fund (UNDP) had urged the developed countries to urgently discuss adaptation funds as the key to solution of the problems. The Lead author of the recent UNDP report, Kevin Watkins said that as per estimate $86 billion annually. \"The figure looks large, but actually it is only 0.2% of the rich countries GDP,\" he said and added that adaptation fund sourced from multilateral funding in the last two years was only $26 million—the amount spent by UK alone on flood control for a week.\nA group of small island communities led by Biotani Indonesia Foundation has urged that the adaptation fund should include a special corpus to cover their initiatives.\nThe Bali conference succeeded in adopting a resolution on technology tranfer and also Its monitoring. It, however, failed address the vital issue of cut in GHG emissions and deferred it till 2009.\nIt also postponed until next year any consideration of a plan to fund an untested technology which captures and buries the greenhouse gas carbon dioxide, emitted from power plants that burn fossil fuels.\nIt also failed to agree whether or not to allow companies to sell carbon offsets from destroying new production of powerful greenhouse gases called hydrofluorocarbons (HFCs). Benefiting factories have been the biggest winners under a UN scheme to reward companies which cut greenhouse gas emissions.\nBe the first to comment.","id":"<urn:uuid:425ca78c-1053-44ec-b60e-8912cf2cb747>","dump":"CC-MAIN-2013-20","url":"http:\/\/www.financialexpress.com\/news\/Bali-Climate-conference-has-a-message-for-rural-community\/251129\/0","file_path":"s3:\/\/commoncrawl\/crawl-data\/CC-MAIN-2013-20\/segments\/1368696381249\/warc\/CC-MAIN-20130516092621-00000-ip-10-60-113-184.ec2.internal.warc.gz","language":"en","language_score":0.948002398,"token_count":543,"score":3.15625,"int_score":3}
{"text":"Financial Accounting - CH 1 & 2\n|Four Principal Activities of Business Firms:|| 1.Establishing goals and strategies|\n|What are the 2 sources Financing comes from?|| 1. Owners|\n|Investments are made in the following:|| 1. Land, buildings, equipment|\n2. Patents, licenses, contractual rights\n3. Stock and bonds of other organizations\n5. Accounts Receivable\n|What are the 4 areas for conducting operations?|| 1. Purchasing|\n|What are the 4 commonly used conventions in financial statements?|| 1. The accounting period|\n2. The number of reporting periods\n3. The monetary amounts\n4. The terminology and level of detail in the financial statements\n|Common Financial Reporting Conventions, Accounting Period||The length of time covered by the financial statements. (The most common interval for external reporting is the fiscal year).|\n|Common Financial Reporting Conventions, Number of reporting periods||The number of reporting periods included in a given financial statement presentation, Both U.S. GAAP and IFRS require firms to include results for multiple reporting periods in each report.|\n|Common Financial Reporting Conventions, Monetary amounts||This includes measuring units, like thousands, millions, or billions, and the currency, such as dollars ($), euros (€), or Swedish kronor (SEK)|\n|Common Financial Reporting Conventions, Terminology and level of detail in the financial statements||U.S. GAAP and IFRS contain broad guidance on what the financial statements must contain, but neither system completely specifies the level of detail or the names of accounts. Therefore, some variation occurs.|\n|Characteristics of a Balance Sheet||A Balance Sheet:|\n1. is also known as a statement of financial position;\n2. provides information at a point in time;\n3. lists the firm's assets, liabilities, and shareholders' equity and provides totals and subtotals; and\n4. can be represented as the Basic Accounting Equation.\nAssets = Liabilities + Shareholders' Equity\n|Accounting Equation Components|| 1. Assets|\n3. Share Holder's Equity\n|Assets|| Assets are economic resources with the potential to provide future economic benefits to a firm. |\nExamples: Cash, Accounts Receivable, Inventories, Buildings, Equipment, intangible assets (like Patents)\n|Liabilities|| Liabilities are creditors' claims for funds, usually because they have provided funds, or goods and services, to the firm.|\nExamples: Accounts Payable, Unearned Income, Notes Payable, Buildings, Accrued Salaries\n|Shareholders' Equity|| Shareholders' Equity shows the amounts of funds owners have provided and, in parallel, their claims on the assets of a firm. |\nExamples: Common Stock, Contributed Capital, Retained Earnings\n|What are the separate sections on a Balance Sheet (Balance sheet classification)||1. Current assets represent assets that a firm expects to turn into cash, or sell, or consume within approximately one year from the date of the balance sheet (i.e., accounts receivable and inventory).|\n2. Current liabilities represent obligations a firm expects to pay within one year (i.e., accounts payable and salaries payable).\n3. Non-current assets are typically held and used for several years (i.e., land, buildings, equipment, patents, long-term security investments).\n4. Noncurrent liabilities and shareholders' equity are sources of funds where the supplier of funds does not expect to receive them all back within the next year.\n|Income Statement||1. Sometimes called the statement of profit and loss by firms applying IFRS|\n2. Provides information on profitability\n3. May use the terms net income, earnings, and profit interchangeably\n4. Reports amounts for a period of time\n5. Typically one year\n6. Is represented by the Basic Income Equation:\nNet Income = Revenues - Expenses\n|Revenues||(also known as sales, sales revenue, or turnover, a term used by some firms reporting under IFRS) measure the inflows of assets (or reductions in liabilities) from selling goods and providing services to customers.|\n|Expenses||measure the outflow of assets (or increases in liabilities) used in generating revenues.|\n|Relationship between the Balance Sheet and the Income Statement|| 1. The income statement links the balance sheet at the beginning of the period with the balance sheet at the end of the period.|\n2. Retained Earnings is increased by net income and decreased by dividends.\n|Statement of Cash Flows|| The statement of cash flows (also called the|\ncash flow statement) reports information about\ncash generated from or used by:\n2. investing, and\n3. financing activities during specified time periods.\nThe statement of cash flows shows where the firm obtains or generates cash and where it spends or uses cash.\n|Classification of Cash Flows|| 1. Operations: |\ncash from customers less cash paid in carrying out the firm's operating activities\ncash paid to acquire noncurrent assets less amounts from any sale of noncurrent assets\ncash from issues of long-term debt or new capital less dividends\n|Inflows and Outflows of Cash|\n|The Relationship of the Statement of Cash Flows to the Balance Sheet and Income Statement||-The statement of cash flows explains the change in cash between the beginning and the end of the period, and separately displays the changes in cash from operating, investing, and financing activities.|\n-In addition to sources and uses of cash, the statement of cash flows shows the relationship between net income and cash flow from operations.\n|Statement of Shareholders' Equity||This statement displays components of shareholders' equity, including common shares and retained earnings, and changes in those components.|\n|Other Items in Annual Reports||Financial reports provide additional explanatory material in the schedules and notes to the financial statements.|\n|Who are the 4 main groups of people involved with the Financial Reporting Process|| 1. Managers and governing boards of reporting entities.|\n2. Accounting standard setters\nand regulatory bodies.\n3. Independent external auditors.\n4. Users of financial statements.\n|What is the Securities and Exchange Commission (SEC)?||An agency of the federal government, that has the legal authority to set acceptable accounting standards and enforce securities laws.|\n|What is the Financial Accounting Standards Board (FASB)?||a private-sector body comprising five voting members, to whom the SEC has delegated most tasks of U.S. financial accounting standard-setting.|\n|GAAP||1. Common terminology includes the pronouncements of the FASB (and its predecessors) in the compilation of accounting rules, procedures, and practices known as generally accepted accounting principles (GAAP).|\n2. Recently, the FASB launched its codification project which organizes all of U.S GAAP by topic (for example, revenues), eliminates duplications, and corrects inconsistencies.\n|FASB board members make standard-setting decisions guided by a conceptual framework that addresses:|| 1. Objectives of financial reporting.|\n2. Qualitative characteristics of accounting information including the relevance, reliability, and comparability of data.\n3. Elements of the financial statements.\n4. Recognition and measurement issues.\n|Sarbanes-Oxley Act of 2002.|| Concerns over the quality of financial reporting have led, and continue to lead, to government initiatives in the United States.|\nSarbanes-Oxley Act of 2002 established the Public Company Accounting Oversight Board (PCAOB), which is responsible for monitoring the quality of audits of SEC registrants.\n|International Financial Reporting Standards (IFRS)||-The International Accounting Standards Board (IASB) is an independent accounting standard-setting entity with 14 voting members from a number of countries. Standards set by the IASB are International Financial Reporting Standards (IFRS).|\n-The FASB and IASB Boards are working toward converging their standards, based on an agreement reached in 2002 and updated since then.\n|Auditor's Opinion||Firms whose common stock is publicly traded are required to get an opinion by an independent auditor who:|\n1.Assesses the effectiveness of the firm's internal control system for measuring and reporting business transactions\n2.Assesses whether the financial statements and notes present fairly a firm's financial position, results of operations, and cash flows in accordance with generally accepted accounting principles\n|Basic Accounting Conventions and Concepts||1. Materiality is the qualitative concept that financial reports need not include items that are so small as to be meaningless to users of the reports.|\n2. The accounting period convention refers to the uniform length of accounting reporting periods.\n3. Interim reports are often prepared for periods shorter than a year. However, preparing interim reports does not eliminate the need to prepare an annual report.\n|Cash vs. Accrual Accounting||Cash basis|\nA firm measures performance from selling goods and providing services as it receives cash from customers and makes cash expenditures to providers of goods and services.\nA firm recognizes revenue when it sells goods or renders services and recognizes expenses in the period when the firm recognizes the revenues that the costs helped produce.\n|What Is an Account? How Do You Name Accounts?||-An account represents an amount on a line of a balance sheet or income statement (i.e., cash, accounts receivable, etc.).|\n-There is not a master list to define these accounts since they are customized to fit each specific business's needs.\n-Accountants typically follow a conventional naming system for accounts, which increases communication.\n|What Accounts Make up the Typical Balance Sheet?|\n|Current assets and current liabilities (Balance Sheet Classifications)||Receipt or payment of assets that the firm expects will occur within one year or one operating cycle.|\n|Noncurrent assets and noncurrent liabilities (Balance Sheet Classifications)||Firm expects to collect or pay these more than one year after the balance sheet date.|\n|Duality Effects of the Balance Sheet Equation (Assets = Liabilites + Shareholders' Equity)||Any single event or transaction will have one of the following four effects or some combination of these effects:|\n1.INCREASE an asset and INCREASE either a liability or shareholders' equity.\n2.DECREASE an asset and DECREASE either a liability or shareholders' equity.\n3.INCREASE one asset and DECREASE another asset.\n4.INCREASE one liability or shareholders' equity and DECREASE another liability or shareholders' equity.\nA T-account is a device or convention for organizing and accumulating the accounting entries of transactions that affect an individual account, such as Cash, Accounts Receivable, Bonds Payable, or Additional Paid-in Capital.\n|T-Account Conventions: Assets|\n|T-Account Conventions: Liabilities|\n|T-Account Conventions: Shareholders' Equity|\n|Debit vs. Credit|\nWhile T-accounts are useful to help analyze how individual transactions flow and accumulate within various accounts, journal entries formalize the reasoning that supports the transaction.\nThe attached standardized format indicates the accounts and amounts, with debits on the first line and credits (indented) on the second line:\n| Revenue or Sales:|\n(Common Income Statement Terms)\n|Assets received in exchange for goods sold and services rendered.|\n| Cost of Goods Sold:|\n(Common Income Statement Terms)\n|The cost of products sold.|\n| Selling, General, and Administrative (SG&A):|\n(Common Income Statement Terms)\n|Costs incurred to sell products\/services as well as costs of administration.|\n| Research and Development (R&D) Expense:|\n(Common Income Statement Terms)\n|Costs incurred to create\/develop new products, processes, and services.|\n| Interest Income:|\n(Common Income Statement Terms)\n|Income earned on amounts lent to others or from investments in interest-yielding securities.|\n|Unique Relationships Exist Between the Balance Sheet and the Income Statement|\n|Important Account Differences||1. Balance sheet accounts are permanent accounts in the sense that they remain open, with nonzero balances, at the end of the reporting period.|\n2. In contrast, income statement accounts are temporary accounts in the sense that they start a period with a zero balance, accumulate information during the reporting period, and have a zero balance at the end of the reporting period.\n|The Financial Statement Relationships can be summarized as:|\n-After preparing the end-of-period income statement, the accountant transfers the balance in each temporary revenue and expense account to the Retained Earnings account.\n-This procedure is called closing the revenue and expense accounts. After transferring to Retained Earnings, each revenue and expense account is ready to begin the next period with a zero balance.\n|Expense and Revenue Transactions|\n|Dividend Declaration and Payment|\n|Issues of Capital Stock|\n|Posting||1. After each transaction is recognized by a journal entry, the information is transferred in the accounting system via an activity known as posting.|\n2. The balance sheet ledger accounts (or permanent accounts) where these are posted begin each period with a balance equal to the ending balance of the previous period.\n3.The income statement ledger accounts (or temporary accounts) have zero beginning balances.\n|Adjusting Entries|| There are some journal entries that are not triggered by a transaction or exchange.|\n-Rather, journal entries known as adjusting entries, result from the passage of time at the end of an accounting period or are used to correct errors (more commonly known as correcting entries).\n|Four Basic Types of Adjusting Entries|| 1.Unearned Revenues|\n|Closing Process||1. After adjusting and correcting entries are made, the income statement can be prepared.|\n2. Once completed, it is time to transfer the balance in each temporary revenue and expense account to the Retained Earnings account. This is known as the closing process.\n3. Each revenue account is reduced to zero by debiting it and each expense account is reduced to zero by crediting it.\n4. The offset account—Retained Earnings—is credited for the amount of total revenues and debited for the amount of total expenses.\n5. Thus, the balance of ending Retained Earnings for a period shows the difference between total revenues and total expenses.\n|Preparation of the Balance Sheet||1. After the closing process is completed, the accounts with nonzero balances are all balance sheet accounts.|\n2. We can use these accounts to prepare the balance sheet as at the end of the period.\n3. The Retained Earnings account will appear with all other balance sheet accounts and now reflects the cumulative effect of transactions affecting that account.\n|Final Step in Preparing Financial Statements: The Cash Flow Statement||1. The statement of cash flows describes the sources and uses of cash during a period and classifies them into operating, investing, and financing activities.|\n2. It provides a detailed explanation for the change in the balance of the Cash account during that period.\n3. Two approaches can be used to prepare this statement: Direct and Indirect","id":"<urn:uuid:03b12dbf-26a3-4290-b6e6-e08368916e2a>","dump":"CC-MAIN-2013-20","url":"http:\/\/quizlet.com\/12638820\/financial-accounting-ch-1-2-flash-cards\/","file_path":"s3:\/\/commoncrawl\/crawl-data\/CC-MAIN-2013-20\/segments\/1368696381249\/warc\/CC-MAIN-20130516092621-00000-ip-10-60-113-184.ec2.internal.warc.gz","language":"en","language_score":0.9089588523,"token_count":3227,"score":3.375,"int_score":3}